/*
Автомобили
1.	Создать класс Car в пакете com.company.vehicles, Engine в пакете com.company.details и Driver в пакете com.company.professions.
2.	Класс Driver содержит поля - ФИО, стаж вождения.
3.	Класс Engine содержит поля - мощность, производитель.
4.	Класс Car содержит поля - марка автомобиля, класс автомобиля, вес, водитель типа Driver, мотор типа Engine. Методы start(), stop(), turnRight(), turnLeft(), которые выводят на печать: "Поехали", "Останавливаемся", "Поворот направо" или "Поворот налево". А также метод toString(), который выводит полную информацию об автомобиле, ее водителе и моторе.
5.	Создать производный от Car класс - Lorry (грузовик), характеризуемый также грузоподъемностью кузова.
6.	Создать производный от Car класс - SportCar, характеризуемый также предельной скоростью

 */
public class Main {
    public static void main(String[] args) {
    }
}